 ## -*- coding: windows-1251 -*-

alphabet = ['АаБбВвГгДдЕеЁёЖжЗзИиЙйКкЛлМмНнОоПпРрСсТтУуФфХхЦцЧчШшЩщЪъЫыЬьЭэЮюЯя ',
            'аБбВвГгДдЕеЁёЖжЗзИиЙйКкЛлМмНнОоПпРрСсТтУуФфХхЦцЧчШшЩщЪъЫыЬьЭэЮюЯя А',
            'БбВвГгДдЕеЁёЖжЗзИиЙйКкЛлМмНнОоПпРрСсТтУуФфХхЦцЧчШшЩщЪъЫыЬьЭэЮюЯя Аа',
            'бВвГгДдЕеЁёЖжЗзИиЙйКкЛлМмНнОоПпРрСсТтУуФфХхЦцЧчШшЩщЪъЫыЬьЭэЮюЯя АаБ',
            'ВвГгДдЕеЁёЖжЗзИиЙйКкЛлМмНнОоПпРрСсТтУуФфХхЦцЧчШшЩщЪъЫыЬьЭэЮюЯя АаБб',
            'вГгДдЕеЁёЖжЗзИиЙйКкЛлМмНнОоПпРрСсТтУуФфХхЦцЧчШшЩщЪъЫыЬьЭэЮюЯя АаБбВ',
            'ГгДдЕеЁёЖжЗзИиЙйКкЛлМмНнОоПпРрСсТтУуФфХхЦцЧчШшЩщЪъЫыЬьЭэЮюЯя АаБбВв',
            'гДдЕеЁёЖжЗзИиЙйКкЛлМмНнОоПпРрСсТтУуФфХхЦцЧчШшЩщЪъЫыЬьЭэЮюЯя АаБбВвГ',
            'ДдЕеЁёЖжЗзИиЙйКкЛлМмНнОоПпРрСсТтУуФфХхЦцЧчШшЩщЪъЫыЬьЭэЮюЯя АаБбВвГг',
            'дЕеЁёЖжЗзИиЙйКкЛлМмНнОоПпРрСсТтУуФфХхЦцЧчШшЩщЪъЫыЬьЭэЮюЯя АаБбВвГгД',
            'ЕеЁёЖжЗзИиЙйКкЛлМмНнОоПпРрСсТтУуФфХхЦцЧчШшЩщЪъЫыЬьЭэЮюЯя АаБбВвГгДд',
            'еЁёЖжЗзИиЙйКкЛлМмНнОоПпРрСсТтУуФфХхЦцЧчШшЩщЪъЫыЬьЭэЮюЯя АаБбВвГгДдЕ',
            'ЁёЖжЗзИиЙйКкЛлМмНнОоПпРрСсТтУуФфХхЦцЧчШшЩщЪъЫыЬьЭэЮюЯя АаБбВвГгДдЕе',
            'ёЖжЗзИиЙйКкЛлМмНнОоПпРрСсТтУуФфХхЦцЧчШшЩщЪъЫыЬьЭэЮюЯя АаБбВвГгДдЕеЁ',
            'ЖжЗзИиЙйКкЛлМмНнОоПпРрСсТтУуФфХхЦцЧчШшЩщЪъЫыЬьЭэЮюЯя АаБбВвГгДдЕеЁё',
            'жЗзИиЙйКкЛлМмНнОоПпРрСсТтУуФфХхЦцЧчШшЩщЪъЫыЬьЭэЮюЯя АаБбВвГгДдЕеЁёЖ',
            'ЗзИиЙйКкЛлМмНнОоПпРрСсТтУуФфХхЦцЧчШшЩщЪъЫыЬьЭэЮюЯя АаБбВвГгДдЕеЁёЖж',
            'зИиЙйКкЛлМмНнОоПпРрСсТтУуФфХхЦцЧчШшЩщЪъЫыЬьЭэЮюЯя АаБбВвГгДдЕеЁёЖжЗ',
            'ИиЙйКкЛлМмНнОоПпРрСсТтУуФфХхЦцЧчШшЩщЪъЫыЬьЭэЮюЯя АаБбВвГгДдЕеЁёЖжЗз',
            'иЙйКкЛлМмНнОоПпРрСсТтУуФфХхЦцЧчШшЩщЪъЫыЬьЭэЮюЯя АаБбВвГгДдЕеЁёЖжЗзИ',
            'ЙйКкЛлМмНнОоПпРрСсТтУуФфХхЦцЧчШшЩщЪъЫыЬьЭэЮюЯя АаБбВвГгДдЕеЁёЖжЗзИи',
            'йКкЛлМмНнОоПпРрСсТтУуФфХхЦцЧчШшЩщЪъЫыЬьЭэЮюЯя АаБбВвГгДдЕеЁёЖжЗзИиЙ',
            'КкЛлМмНнОоПпРрСсТтУуФфХхЦцЧчШшЩщЪъЫыЬьЭэЮюЯя АаБбВвГгДдЕеЁёЖжЗзИиЙй',
            'кЛлМмНнОоПпРрСсТтУуФфХхЦцЧчШшЩщЪъЫыЬьЭэЮюЯя АаБбВвГгДдЕеЁёЖжЗзИиЙйК',
            'ЛлМмНнОоПпРрСсТтУуФфХхЦцЧчШшЩщЪъЫыЬьЭэЮюЯя АаБбВвГгДдЕеЁёЖжЗзИиЙйКк',
            'лМмНнОоПпРрСсТтУуФфХхЦцЧчШшЩщЪъЫыЬьЭэЮюЯя АаБбВвГгДдЕеЁёЖжЗзИиЙйКкЛ',
            'МмНнОоПпРрСсТтУуФфХхЦцЧчШшЩщЪъЫыЬьЭэЮюЯя АаБбВвГгДдЕеЁёЖжЗзИиЙйКкЛл',
            'мНнОоПпРрСсТтУуФфХхЦцЧчШшЩщЪъЫыЬьЭэЮюЯя АаБбВвГгДдЕеЁёЖжЗзИиЙйКкЛлМ',
            'НнОоПпРрСсТтУуФфХхЦцЧчШшЩщЪъЫыЬьЭэЮюЯя АаБбВвГгДдЕеЁёЖжЗзИиЙйКкЛлМм',
            'нОоПпРрСсТтУуФфХхЦцЧчШшЩщЪъЫыЬьЭэЮюЯя АаБбВвГгДдЕеЁёЖжЗзИиЙйКкЛлМмН',
            'ОоПпРрСсТтУуФфХхЦцЧчШшЩщЪъЫыЬьЭэЮюЯя АаБбВвГгДдЕеЁёЖжЗзИиЙйКкЛлМмНн',
            'оПпРрСсТтУуФфХхЦцЧчШшЩщЪъЫыЬьЭэЮюЯя АаБбВвГгДдЕеЁёЖжЗзИиЙйКкЛлМмНнО',
            'ПпРрСсТтУуФфХхЦцЧчШшЩщЪъЫыЬьЭэЮюЯя АаБбВвГгДдЕеЁёЖжЗзИиЙйКкЛлМмНнОо',
            'пРрСсТтУуФфХхЦцЧчШшЩщЪъЫыЬьЭэЮюЯя АаБбВвГгДдЕеЁёЖжЗзИиЙйКкЛлМмНнОоП',
            'РрСсТтУуФфХхЦцЧчШшЩщЪъЫыЬьЭэЮюЯя АаБбВвГгДдЕеЁёЖжЗзИиЙйКкЛлМмНнОоПп',
            'рСсТтУуФфХхЦцЧчШшЩщЪъЫыЬьЭэЮюЯя АаБбВвГгДдЕеЁёЖжЗзИиЙйКкЛлМмНнОоПпР',
            'СсТтУуФфХхЦцЧчШшЩщЪъЫыЬьЭэЮюЯя АаБбВвГгДдЕеЁёЖжЗзИиЙйКкЛлМмНнОоПпРр',
            'сТтУуФфХхЦцЧчШшЩщЪъЫыЬьЭэЮюЯя АаБбВвГгДдЕеЁёЖжЗзИиЙйКкЛлМмНнОоПпРрС',
            'ТтУуФфХхЦцЧчШшЩщЪъЫыЬьЭэЮюЯя АаБбВвГгДдЕеЁёЖжЗзИиЙйКкЛлМмНнОоПпРрСс',
            'тУуФфХхЦцЧчШшЩщЪъЫыЬьЭэЮюЯя АаБбВвГгДдЕеЁёЖжЗзИиЙйКкЛлМмНнОоПпРрСсТ',
            'УуФфХхЦцЧчШшЩщЪъЫыЬьЭэЮюЯя АаБбВвГгДдЕеЁёЖжЗзИиЙйКкЛлМмНнОоПпРрСсТт',
            'уФфХхЦцЧчШшЩщЪъЫыЬьЭэЮюЯя АаБбВвГгДдЕеЁёЖжЗзИиЙйКкЛлМмНнОоПпРрСсТтУ',
            'ФфХхЦцЧчШшЩщЪъЫыЬьЭэЮюЯя АаБбВвГгДдЕеЁёЖжЗзИиЙйКкЛлМмНнОоПпРрСсТтУу',
            'фХхЦцЧчШшЩщЪъЫыЬьЭэЮюЯя АаБбВвГгДдЕеЁёЖжЗзИиЙйКкЛлМмНнОоПпРрСсТтУуФ',
            'ХхЦцЧчШшЩщЪъЫыЬьЭэЮюЯя АаБбВвГгДдЕеЁёЖжЗзИиЙйКкЛлМмНнОоПпРрСсТтУуФф',
            'хЦцЧчШшЩщЪъЫыЬьЭэЮюЯя АаБбВвГгДдЕеЁёЖжЗзИиЙйКкЛлМмНнОоПпРрСсТтУуФфХ',
            'ЦцЧчШшЩщЪъЫыЬьЭэЮюЯя АаБбВвГгДдЕеЁёЖжЗзИиЙйКкЛлМмНнОоПпРрСсТтУуФфХх',
            'цЧчШшЩщЪъЫыЬьЭэЮюЯя АаБбВвГгДдЕеЁёЖжЗзИиЙйКкЛлМмНнОоПпРрСсТтУуФфХхЦ',
            'ЧчШшЩщЪъЫыЬьЭэЮюЯя АаБбВвГгДдЕеЁёЖжЗзИиЙйКкЛлМмНнОоПпРрСсТтУуФфХхЦц',
            'чШшЩщЪъЫыЬьЭэЮюЯя АаБбВвГгДдЕеЁёЖжЗзИиЙйКкЛлМмНнОоПпРрСсТтУуФфХхЦцЧ',
            'ШшЩщЪъЫыЬьЭэЮюЯя АаБбВвГгДдЕеЁёЖжЗзИиЙйКкЛлМмНнОоПпРрСсТтУуФфХхЦцЧч',
            'шЩщЪъЫыЬьЭэЮюЯя АаБбВвГгДдЕеЁёЖжЗзИиЙйКкЛлМмНнОоПпРрСсТтУуФфХхЦцЧчШ',
            'ЩщЪъЫыЬьЭэЮюЯя АаБбВвГгДдЕеЁёЖжЗзИиЙйКкЛлМмНнОоПпРрСсТтУуФфХхЦцЧчШш',
            'щЪъЫыЬьЭэЮюЯя АаБбВвГгДдЕеЁёЖжЗзИиЙйКкЛлМмНнОоПпРрСсТтУуФфХхЦцЧчШшЩ',
            'ЪъЫыЬьЭэЮюЯя АаБбВвГгДдЕеЁёЖжЗзИиЙйКкЛлМмНнОоПпРрСсТтУуФфХхЦцЧчШшЩщ',
            'ъЫыЬьЭэЮюЯя АаБбВвГгДдЕеЁёЖжЗзИиЙйКкЛлМмНнОоПпРрСсТтУуФфХхЦцЧчШшЩщЪ',
            'ЫыЬьЭэЮюЯя АаБбВвГгДдЕеЁёЖжЗзИиЙйКкЛлМмНнОоПпРрСсТтУуФфХхЦцЧчШшЩщЪъ',
            'ыЬьЭэЮюЯя АаБбВвГгДдЕеЁёЖжЗзИиЙйКкЛлМмНнОоПпРрСсТтУуФфХхЦцЧчШшЩщЪъЫ',
            'ЬьЭэЮюЯя АаБбВвГгДдЕеЁёЖжЗзИиЙйКкЛлМмНнОоПпРрСсТтУуФфХхЦцЧчШшЩщЪъЫы',
            'ьЭэЮюЯя АаБбВвГгДдЕеЁёЖжЗзИиЙйКкЛлМмНнОоПпРрСсТтУуФфХхЦцЧчШшЩщЪъЫыЬ',
            'ЭэЮюЯя АаБбВвГгДдЕеЁёЖжЗзИиЙйКкЛлМмНнОоПпРрСсТтУуФфХхЦцЧчШшЩщЪъЫыЬь',
            'эЮюЯя АаБбВвГгДдЕеЁёЖжЗзИиЙйКкЛлМмНнОоПпРрСсТтУуФфХхЦцЧчШшЩщЪъЫыЬьЭ',
            'ЮюЯя АаБбВвГгДдЕеЁёЖжЗзИиЙйКкЛлМмНнОоПпРрСсТтУуФфХхЦцЧчШшЩщЪъЫыЬьЭэ',
            'юЯя АаБбВвГгДдЕеЁёЖжЗзИиЙйКкЛлМмНнОоПпРрСсТтУуФфХхЦцЧчШшЩщЪъЫыЬьЭэЮ',
            'Яя АаБбВвГгДдЕеЁёЖжЗзИиЙйКкЛлМмНнОоПпРрСсТтУуФфХхЦцЧчШшЩщЪъЫыЬьЭэЮю',
            'я АаБбВвГгДдЕеЁёЖжЗзИиЙйКкЛлМмНнОоПпРрСсТтУуФфХхЦцЧчШшЩщЪъЫыЬьЭэЮюЯ',
            ' АаБбВвГгДдЕеЁёЖжЗзИиЙйКкЛлМмНнОоПпРрСсТтУуФфХхЦцЧчШшЩщЪъЫыЬьЭэЮюЯя']

text = input ("Текст для шифрования: ")
k = input("Введите ключ шифрования: ")

result = ""
msg = ""

def encoder(text, key):
    result = ""
    i = 0
    j = 0
    flag = 0
    for symb in text:
        if symb in alphabet[0]:
            if(j == len(key)):
                j = 0
            while i < 66:
                
                if(alphabet[i][0] == key[j]):
                    flag = i
                    break
                i = i+1
            position = alphabet[0].find(symb)
            result +=alphabet[flag][position]
            j = j+1
            i = 0

        else:
            result += symb

    print("Зашифрованный текст:", result)
    return result
    
def decoder(text, key):
    begin_msg = ""
    i = 0
    j = 0
    flag = 0
    for symb in text:
        if symb in alphabet[0]:
            if(j == len(key)):
                j = 0
            while i < 66:
                
                if(alphabet[i][0] == key[j]):
                    flag = i
                    break
                i = i+1
            position = alphabet[flag].find(symb)
            begin_msg +=alphabet[0][position]
            j = j+1
            i = 0

        else:
            begin_msg += symb

    print("Расшифрованный текст:", begin_msg)




    return begin_msg

result = encoder(text, k)
msg = decoder(result, k)